* Isunnguata_M2-10B
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Isunnguata_M2-10B
Place name                       | Isunnguata Sermia
Geographic location              | Central West Greenland
Ice type                         | Ice sheet
Data Source                      | Meierbachtol email
Data DOI                         | 
Science Source                   | Harrington, Joel A., Humphrey, Neil F., Harper, Joel T.: Temperature distribution and thermal anomalies along a flowline of the Greenland ice sheet , Annals of Glaciology 56(70), 98–104, 2015 
Science DOI                      | 10.3189/2015AoG70A940
Date                             | 2010
Longitude [°E]                   | -50.06633
Latitude [°N]                    | 67.16704
Location Source                  | T. Meierbachtol email
Depth of top measurement [m]     | 6.0
Depth of bottom measurement [m]  | 131
Ice thickness [m]                | 146
Coverage [% of thickness]        | 86
Ice thickness source             | T. Meierbachtol email
Note                             | See data in M1-10 folder; Harrington 2015 name: S1-B
#+end_example

** Temperature

** Thickness

** Location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|     d |     t |
|   5.0 |  0.37 |
|  15.0 |  -0.2 |
|  25.0 | -0.01 |
|  35.0 |   0.0 |
|  45.0 |  0.08 |
|  55.0 |  0.01 |
|  65.0 | -0.03 |
|  75.0 | -0.01 |
|  85.0 |  0.01 |
|  95.0 | -0.02 |
| 105.0 |   0.0 |
| 125.0 |   0.0 |
| 135.0 |  0.01 |


